app/views/home/index.html.erb

            <p class="media-body pb-3 mb-0 small lh-125 border-bottom border-gray">
            <strong class="d-block text-gray-dark">Auteur : <%=link_to "#{g.user.first_name} #{g.user.last_name}", user_path(g.user.id)%></strong>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]