app/views/user/show.html.erb

        <p>Ses potins :
        <% @user.gossips.each do |g|%>
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."user_id" = $1  [["user_id", 5]]