app/controllers/gossip_controller.rb

  def show
    @gossip = Gossip.find(params['id'])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    u = User.create(first_name: params[:first_name], last_name: params[:last_name], city_id: 1)
    Gossip.create!(title: params[:title], content: params[:content], user_id: u.id)
---
INSERT INTO "users" ("first_name", "last_name", "city_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "aze "], ["last_name", "az eaz"], ["city_id", 1], ["created_at", "2019-08-06 20:22:28.763587"], ["updated_at", "2019-08-06 20:22:28.763587"]]
INSERT INTO "users" ("first_name", "last_name", "city_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "zea"], ["last_name", "eae"], ["city_id", 1], ["created_at", "2019-08-06 22:13:39.378682"], ["updated_at", "2019-08-06 22:13:39.378682"]]
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "azeazeza"], ["content", "azeaze aze azeaz e"], ["user_id", 15], ["created_at", "2019-08-06 20:22:28.779271"], ["updated_at", "2019-08-06 20:22:28.779271"]]