app/controllers/home_controller.rb

SELECT "gossips".* FROM "gossips"
---
  def show
  @gossips = Gossip.all