app/controllers/home_controller.rb

SELECT  "gossips".* FROM "gossips" ORDER BY "gossips"."id" DESC LIMIT $1  [["LIMIT", 3]]
SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 3]]
---
  def index
    @gossip = Gossip.last(3)
    @user = User.last(3)